fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработаннойПлаты/ВКМ_НачислениеЗаработаннойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработаннойПлаты</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_Удержания</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>EnumRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудникам/ВКМ_УсловияОплатыСотрудникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудникам</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроцентНазначен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>EnumRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ОтпускаСотрудников/ВКМ_ОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ОтпускаСотрудников</name>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработаннойПлаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		СформироватьОсновныеДвижения();
		
		РассчитатьОклад();
		РассчитатьОтпуск();
		
		СформирватьДвиженияУдержания();
		РассчитатьУдержания();
		СформироватьДвиженияВзаиморасчетыССотрудниками();
		СформироватьДвиженияОтпускаСотрудников(); 
		
	КонецПроцедуры
	#КонецОбласти

    #Область СлужебныеПроцедурыИФункции
	Процедура СформироватьОсновныеДвижения()
		
		Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.Сотрудник.Подразделение КАК Подразделение,
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.ДатаНачала КАК ПериодДействияНачало,
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.ДатаОкончания КАК ПериодДействияКонец,
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.ГрафикРаботы КАК ГрафикРаботы
		|ПОМЕСТИТЬ ВТ_Док
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработаннойПлаты.Начисления КАК ВКМ_НачислениеЗаработаннойПлатыНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачислениеЗаработаннойПлатыНачисления.ВидРасчета = &ВидРасчетаОклад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Док.Сотрудник КАК Сотрудник,
		|	ВТ_Док.Подразделение КАК Подразделение,
		|	ВТ_Док.ВидРасчета КАК ВидРасчета,
		|	ВТ_Док.ПериодДействияКонец КАК ПериодДействияКонец,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудникамСрезПоследних.Оклад, 0) КАК Оклад,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_Док.ПериодДействияНачало КАК ПериодДействияНачало,
		|	NULL КАК БазовыйПериодНачало,
		|	NULL КАК БазовыйПериодКонец,
		|	ВТ_Док.ГрафикРаботы КАК ГрафикРаботы
		|ИЗ
		|	ВТ_Док КАК ВТ_Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудникам.СрезПоследних(
		|				&ПериодРегистрации,
		|				Сотрудник В
		|					(ВЫБРАТЬ
		|						ВТ_Док.Сотрудник КАК Сотрудник
		|					ИЗ
		|						ВТ_Док КАК ВТ_Док)) КАК ВКМ_УсловияОплатыСотрудникамСрезПоследних
		|		ПО ВТ_Док.Сотрудник = ВКМ_УсловияОплатыСотрудникамСрезПоследних.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.Сотрудник,
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.Сотрудник.Подразделение,
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.ВидРасчета,
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.ДатаОкончания,
		|	NULL,
		|	&ПериодРегистрации,
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.ДатаНачала,
		|	ДОБАВИТЬКДАТЕ(&ПериодРегистрации, МЕСЯЦ, -12),
		|	ДОБАВИТЬКДАТЕ(&ПериодРегистрации, СЕКУНДА, -1),
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.ГрафикРаботы
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработаннойПлаты.Начисления КАК ВКМ_НачислениеЗаработаннойПлатыНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачислениеЗаработаннойПлатыНачисления.ВидРасчета = &ВидРасчетаОтпуск";
		
		Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
		Запрос.УстановитьПараметр("ВидРасчетаОтпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		// Заполнение набора записей
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
		КонецЦикла;
		Движения.ВКМ_ОсновныеНачисления.Записать();
		
		
	КонецПроцедуры
	
	Процедура РассчитатьОклад() 
		
		// РАСЧЕТ ОКЛАДА
		// Формула расчета: 
		//[Начальное значение оклада] / [Количество рабочих дней] * [Количество отработанных дней] + Процент от выполненных работ
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Оклад КАК Оклад,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаНадбавка
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
		|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник";
		
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки -1];
			СуммаКНачислению = ВыборкаДетальныеЗаписи.Оклад * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.План + ВыборкаДетальныеЗаписи.СуммаНадбавка;
			Движение.Результат = СуммаКНачислению;
			Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.Факт;
			
		КонецЦикла;
		Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	КонецПроцедуры  
	
	Процедура РассчитатьОтпуск(); 
		
		// РАСЧЕТ Отпускных
		// Формула расчета: 
		//[Сумма базы (по окладу)] / [Количество отработанных рабочих дней в базовом периоде] * [Количество дней в отпуске] 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК РезультатБаза,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК ДнейБаза
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
		|			Регистратор = &Ссылка 
		|			И ВидРасчета = &ВидРасчетаОтпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
		|				&Измерения,
		|				&Измерения,
		|				,
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &ВидРасчетаОтпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
		|		ПО (ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки)";
		
		
		Запрос.УстановитьПараметр("ВидРасчетаОтпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		Измерения = Новый Массив;
		Измерения.Добавить("Сотрудник");
		Измерения.Добавить("Подразделение");
		Запрос.УстановитьПараметр("Измерения", Измерения);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			
			Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки -1];
			СуммаКНачислению = ?(ВыборкаДетальныеЗаписи.ДнейБаза = 0,0, ВыборкаДетальныеЗаписи.РезультатБаза / ВыборкаДетальныеЗаписи.ДнейБаза * ВыборкаДетальныеЗаписи.Факт); 
			
			Движение.Результат = СуммаКНачислению;
			Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.Факт;
			
		КонецЦикла;
		Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
		
	КонецПроцедуры
	
	Процедура СформирватьДвиженияУдержания()
		
		Движения.ВКМ_Удержания.Записывать = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.ПериодДействияНачало КАК БазовыйПериодНачало,
		|	ВКМ_ОсновныеНачисления.ПериодДействияКонец КАК БазовыйПериодКонец,
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ОсновныеНачисления.Подразделение КАК Подразделение,
		|	ВКМ_ОсновныеНачисления.Результат КАК Показатель,
		|	ВКМ_ОсновныеНачисления.Сторно КАК Сторно
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ПериодРегистрации = КонецМесяца(Дата);
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		Движения.ВКМ_Удержания.Записать();
	КонецПроцедуры
	
	Процедура РассчитатьУдержания()
		
		ВКМ_РассчитатьУдержанияНДФЛ.РассчитатьНачисления(Ссылка, Движения.ВКМ_Удержания);
		
	КонецПроцедуры
	
	Процедура СформироватьДвиженияВзаиморасчетыССотрудниками()
		
		// ДВИЖЕНИЯ ПО РЕГИСТРУ ВЗАИМОРАСЧЕТЫ С СОТРУДНИКАМИ
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК Сумма
		|ПОМЕСТИТЬ ВТ_Начисления
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник,
		|	-ВКМ_Удержания.Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Начисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВТ_Начисления.Сумма) КАК Сумма
		|ИЗ
		|	ВТ_Начисления КАК ВТ_Начисления
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Начисления.Сотрудник";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
		КонецЦикла;
		
	КонецПроцедуры	
	
	Процедура СформироватьДвиженияОтпускаСотрудников()
		
		// регистр ВКМ_ОтпускаСотрудников Расход
		
		Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.ДатаНачала КАК ДатаНачала,
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.ДатаОкончания КАК ДатаОкончания,
		|	РАЗНОСТЬДАТ(ВКМ_НачислениеЗаработаннойПлатыНачисления.ДатаНачала, ВКМ_НачислениеЗаработаннойПлатыНачисления.ДатаОкончания, ДЕНЬ) + 1 КАК КоличествоДней
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработаннойПлаты.Начисления КАК ВКМ_НачислениеЗаработаннойПлатыНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗаработаннойПлатыНачисления.ВидРасчета = &ВидРасчетаОтпуск
		|	И ВКМ_НачислениеЗаработаннойПлатыНачисления.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидРасчетаОтпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.Год = НачалоГода(Дата);
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.ДатаНачалаФакт = Выборка.ДатаНачала;
			Движение.ДатаОкончанияФакт = Выборка.ДатаОкончания;
			Движение.КоличествоДней = Выборка.КоличествоДней;
		КонецЦикла;
		
	КонецПроцедуры	
	
	#КонецОбласти
	
#КонецЕсли
